#81번
print("081번")
리스트1 = [8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
*변수1,a,b= 리스트1
print(변수1)
#82번
print("082번")
리스트2 = [8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
d,c,*변수2= 리스트2
print(변수2)
#83번
print("083번")
리스트3 = [8.8,8.9,8.7,9.2,9.3,9.7,9.9,9.5,7.8,9.4]
e,*변수3,f= 리스트3
print(변수3)
#84번
print("084번")
temp = {}
#85번
print("085번")
딕셔너리1 = {"메로나":1000,"폴라포":1200,"빵빠레":1800}
print(딕셔너리1)
#86번
print("086번")
딕셔너리1["죠스바"] = 1200
딕셔너리1["월드콘"] = 1500
print(딕셔너리1)
#87번
print("087번")
print("메로나가격",딕셔너리1["메로나"],"원")
#88번
print("088번")
딕셔너리1["메로나"] = 1300
print(딕셔너리1)
#89번
print("089번")
del 딕셔너리1["메로나"]
print(딕셔너리1)
#90번
print("090번")
print("누가바의 값을 설정하지 않고 단일개체로 두었기때문에")
