#51번
print("051번")
리스트1 = ["닥터스트레인지","스플릿","럭키"]
print(리스트1)
#52번
print("052번")
리스트1.append("배트맨")
print(리스트1)
#53번
print("053번")
리스트1.insert(1,"슈퍼맨")
print(리스트1)
#54번
print("054번")
리스트1.remove("럭키")
print(리스트1)
#55번
print("055")
리스트1.remove("스플릿")
리스트1.remove("배트맨")
print(리스트1)
#56번
print("056번")
리스트2 = ["C","C++","JAVA"]
리스트3 = ["Python","Go","C#"]
리스트4 = 리스트2 + 리스트3
print(리스트4)
#57번
print("057번")
리스트5 = [1,2,3,4,5,6,7]
print("max:",max(리스트5),"min:",min(리스트5))
#58번
print("058번")
리스트6 = [1,2,3,4,5]
print(리스트6[0] +리스트6[1] +리스트6[2] +리스트6[3] +리스트6[4])
#59번
print("059번")
리스트7 = ["피자","김밥","만두","양념치킨","족발","피자","김치만두","졸면","쏘세지","라면","팥빙수","김치전"]
print(len(리스트7))
#60번
print("060번")
리스트8 = [1,2,3,4,5]
print(sum(리스트8)/len(리스트8))


