#181번
print("181번")
이차원1 = [["101호","102호"],["201호","202호"],["301호","302호"]]
print(이차원1)
#182번
print("182번")
이차원2 = [[100,200,300],[80,210,330]]
print(이차원2)
#183번
print("183번")
이차원3 = [[100,200,300],[80,210,330]]
딕션1 = {"시가":이차원3[0],"종가":이차원3[1]}
print(딕션1)
#184번
print("184번")
이차원4 =[[80,110,70,90],[210,230,190,200]]
딕션2 = {"10/10":이차원4[0],"10/11":이차원4[1]}
print(딕션2)
#185번
print("185번")
이차원1 = [["101호","102호"],["201호","202호"],["301호","302호"]]
for 변수 in 이차원1:
    print(변수[0])
    print(변수[1])
#186번
print("----186번----")
이차원1 = [["101호","102호"],["201호","202호"],["301호","302호"]]
for 변수 in 이차원1[::-1]:
    print(변수[0])
    print(변수[1])
#187번
print("----187번----")
이차원1 = [["101호","102호"],["201호","202호"],["301호","302호"]]
for 변수 in 이차원1[::-1]:
    print(변수[::-1][0])
    print(변수[::-1][1])
#188번
print("----188번----")
이차원1 = [["101호","102호"],["201호","202호"],["301호","302호"]]
for 변수 in 이차원1:
    print(변수[0])
    print("-" * 4)
    print(변수[1])
    print("-" * 4)
#189번
print("189번")
이차원1 = [["101호","102호"],["201호","202호"],["301호","302호"]]
for 변수 in 이차원1:
    print(변수[0])
    print(변수[1])
    print("-" * 4)
#190번
print("190번")
이차원1 = [["101호","102호"],["201호","202호"],["301호","302호"]]
for 변수 in 이차원1:
    print(변수[0])
    print(변수[1])
print("-" * 4)