#71번
print("071번")
튜플1 = ()
#72번
print("072번")
튜플1 = ("닥터스트레인지","스플릿","럭키")
print(튜플1)
#73번
print("073번")
튜플2 = (1,)
print(튜플2)
#74번
print("074번")
print("튜플의 요소를 바꾸려는 행위는 튜플에서 지원되지 않기때문에")
#75번
print("075번")
print("튜플은 괄호없이도 동작함")
#76번
print("076번")
튜플3 = ('a','b','c')
튜플3 = ('A','b','c')
print(튜플3)
#77번
print("077번")
튜플4 = ('삼전','엘지','스크')
리스트1 = list(튜플4)
print(튜플4)
#78번
print("078번")
리스트2 = ['삼전','엘지','스크']
튜플5 = tuple(리스트2)
print(튜플5)
#79번
print("079번")
print("애플,바나나,케이크가 출력된다 temp를 a,b,c에 대입하겠다는 뜻이므로 a,b,c=temp=ap,ba,ca다")
#80번
print("080번")
튜플6 = tuple(range(2,100,2))
print(튜플6)

