#61번
print("061번")
리스트1 = ['20180728',100,130,140,150,160,170]
print(리스트1[1:6])
#62번
print("062번")
리스트2 = [1,2,3,4,5,6,7,8,9,10]
print(리스트2[0::2])
#63번
print("063번")
리스트2 = [1,2,3,4,5,6,7,8,9,10]
print(리스트2[1::2])
#64번
print("064번")
리스트3 = [1,2,3,4,5]
print(리스트3[::-1])
#65번
print("065번")
리스트4 = ['삼성전자','LG전자',"Naver"]
print(리스트4[0],리스트4[2])
#66번
print("066번")
리스트5 = ['삼전','LG','N','SK','미래셋']
print(" ".join(리스트5))
#67번
print("067번")
리스트5 = ['삼전','LG','N','SK','미래셋']
print("/".join(리스트5))
#68번
print("068번")
리스트5 = ['삼전','LG','N','SK','미래셋']
print("\n".join(리스트5))
#69번
print("069번")
리스트4 = '삼성전자/LG전자/Naver'
print(리스트4.split("/"))
#70번
print("70번")
리스트6 = [2,4,3,1,5,10,9]
리스트6.sort()
print(리스트6)