#91번
print("091번")
딕셔너리1 = {"메로나":[300,20],"비비빅":[400,3],"죠스바":[250,100]}
print(딕셔너리1)
#92번
print("092번")
print(딕셔너리1["메로나"][0],"원")
#93번
print("093번")
print(딕셔너리1["메로나"][1],"개")
#94번
print("094번")
딕셔너리1["월드콘"] = [500,7]
print(딕셔너리1)
#95번
print("095번")
리스트1 = []
딕셔너리2 = {'탱크보이':1200,'폴라포':1200,'빵빠레':1800,'월드콘':1500,'메로나':1000}
리스트1.append(딕셔너리1.keys())
print(리스트1)
#96번
print("096번")
리스트2=[]
리스트2.append(딕셔너리2.values())
print(리스트2)
#97번
print("097번")
print(sum(딕셔너리2.values()),"원")
#98번
print("098번")
딕셔너리2 = {'탱크보이':1200,'폴라포':1200,'빵빠레':1800,'월드콘':1500,'메로나':1000}
딕셔너리3 = {'팥빙수':2700,'아맛나':1000}
딕셔너리2.update(딕셔너리3)
print(딕셔너리2)
#99번
print("099번")
딕셔너리4 = {}
튜플1 = ("apple","pear","peach")
튜플2 = (300,250,400)
딕셔너리4 = dict(zip(튜플1,튜플2))
print(딕셔너리4)
#100번
print("100번")
딕셔너리5 = {}
리스트3 = ['09/05','09/06','09/07','09/08','09/09']
리스트4 = [10500,10300,10100,10800,11000]
딕셔너리5 = dict(zip(리스트3,리스트4))
print(딕셔너리5)