1.print()_ 함수
    정의 : 무언가를 출력할때 사용하는 함수이다
    사용방법 :print() 함수를 이용해 괄호안에 "" 를 넣고 "" 안에 문자를 써서 콘솔에 출력해낼수 있다

2. type() int() str() float() 함수
    정의 : 문자의 형태를 나타내는 함수이다
    사용방법 : 타입은 해당 문자의 형태를 알아낼때 인트는 문자열을 정수로 바꾸거나 정수를 입력할때 str은 정수를 문자열로 바꿀때나 문자를
             입력할때 사용되고 float은 유리수를 나타낼때 주로 사용된다

3. 인덱싱이란
    리스트나 무언가의 순서를 나타내는것으로 원하는 정보의 번호를 입력하거나 특정 순서를 입력했을때 해당 번호의 인덱스가 호출된다

4. 슬라이싱
    정의 : 문자나 정수 리스트등에서 일부만 가져오는것
    사용방법 : 콜론(:X)를 이용해서 이름[:X] 이름[::X] 이름[Y:X] 처럼 Y부터 X까지,X까지 X부터 등으로 사용됨
5.replace() 함수
    정의 : 지정한 텍스트나 인덱스부터의 문자열을 다른 문자열로 바꿔주는 함수
    사용방법 : 변수(함수,리스트)이름.replace("A"," ")라고 한다면 A를 공백으로 바꾸겠다는 뜻이고 문자나 특정 문자를 바꿔야할때 사용된다
